{"course": "cis519", "comments": [{"content": "Glosses over material (much like prior courses in this specialization), the professor is audibly nervous during recorded lectures, and many assignments require information and functions not covered in the lectures. Additionally, out of date Python modules are used in the notebooks, so you're learning often deprecated usage patterns, not to mention the constant struggle that is the auto-grader. You can teach yourself with free resources and save yourself the money and unhelpful bouts of rage against the auto-grader.\n", "time": "2020-11-05", "source": "Mock", "upvotes": "8"}, {"content": "Not very good compared to the first two courses :( :( :( ... I took a Machine Learning Class from Stanford which was incredibly well put together and presented (though to be fair, it was 12 weeks), but it was in MatLab and I wanted to take a course in Python just to have a different perspective and solidify my understanding. Unfortunately, I find this course to be confusing more than anything. If I hadn't taken the Stanford course before, I'd be completely lost. It's very dry, dense, and hand-wavy and doesn't go into a whole lot of details with anything leaving you wondering what's happening and why and how... I don't approve of jumping straight to using the built-in functions if you don't understand the processes behind them (which I personally don't have a solid grasp on them still) ... I think they are just trying to fit too much information into four weeks and it's really lacking. Maybe if you're already familiar with linear regression, it's not as hard to follow. Either way, I'd recommend either taking the Stanford class first, or learning about this stuff elsewhere before starting this course.\n", "time": "2020-11-07", "source": "Mock", "upvotes": "7"}, {"content": "I want to give this course a higher score because I do think I learned A TON. However, I learned a ton because the course had some flaws in instructions and assignments that required some frustrating moments and a lot of outside work to correct. If you take this course, DISCUSSION FORUMS are a must because of all the errors and bugs in assignments. The explanations are a little 'too rosy' in the videos in my opinion (they show best case scenarios) so there's a disconnect in what i actually had to do to pass the assignments which tended to have lots of room for improvement. That said, if you are willing to go out on your own and figure it out (mentors are so-so in actually helping), then this course is a great ML workout!\n", "time": "2021-01-09", "source": "Mock", "upvotes": "8"}, {"content": "There is a huge difference between teaching / tutoring and just reading some pre-written scripts. Even on an online course. Andrew Ng's Machine Learning course is a great example of teaching and this was one of the worst courses I have ever taken in coursera / udacity.\n", "time": "2020-11-13", "source": "Mock", "upvotes": "4"}, {"content": "A lot of stuff, compressed in a short time. It's more about memorizing a lot of concepts rather than understanding them. I strongly recommend to take the course of professor Andrew Ng before this one.\n", "time": "2020-12-23", "source": "Mock", "upvotes": "14"}, {"content": "This course is ideally designed for understanding, which tools you can use to do machine learning tasks in python. However, for deep understanding ML algorithms you should take more math based courses\n", "time": "2020-12-24", "source": "Mock", "upvotes": "5"}, {"content": "The video lectures are boring and unstructured. You can tell the lecturer really hates what he is doing often sulking and showing zero enthusiasm. Also, he makes you question if he really knows what he is talking about. I am sure he does but his attitude and sloppy mistakes give you doubt. The format of the video lectures is that the lecturer reads a script in front of the camera and the algorithm he talks about is shown in cutscenes. This is a terrible idea. Also, the courses are not well prepared, lacking continuity. On top of that lecturer often makes mistakes and these mistakes are \"corrected\" by showing you a cutscene that writes the professor wanted to say X instead of Y. This is really sloppy. This is not an open course where you put your recorded lectures to youtube for free. You are delivering these lectures to paying customers. Seriously many free lectures on youtube are better built compared to these lectures. I have learned a lot of things in these lectures by doing the assignments and trying to learn by using google and not via lectures. One positive thing about this course is that there are some good links to papers, websites etc... But you need a lot of time to go through them.\n", "time": "2020-10-13", "source": "Mock", "upvotes": "5"}, {"content": "This is a great course for those with limited experience of machine learning, wishing to quickly grasp how to apply machine learning methods and get their hands dirty. In my opinion, this is the best course in the specialization so far and as in previous courses you are expected to dig into further theoretical/usage details yourself from online documentation (hence the name applied). Concise lectures and interesting reading materials, as well as hands-on assignments. My recommendation is to either start with this course or take it together with more theoretical courses (such as \"Machine Learning\" from Stanford or \"Machine Learning Fundamentals\" from UCSD) to get the full flavour of what machine learning has to offer.\n", "time": "2020-11-28", "source": "Mock", "upvotes": "11"}, {"content": "I know It is a hard subject to teach, but many ways to improve. Students could have been able to understand those concepts much better by using common or popular topics for assignment cases or practices. Without context, many useful concepts taught are forgotten right away. Lecturer should have not explain those concepts by simply talking to the camera without illustration or vivid examples. Often the way lecturer speaks and teaches is quite boring. \n", "time": "2021-01-17", "source": "Mock", "upvotes": "16"}, {"content": "A lot of bugs in Assignments. Instead of learning ML need to go though forums/code to fix simple bugs like files locations readonly/  etc\n", "time": "2020-11-11", "source": "Mock", "upvotes": "5"}, {"content": "Very well structured course, and very interesting too! Has made me want to pursue a career in machine learning. I originally just wanted to learn to program, without true goal, now I have one thanks!!\n", "time": "2020-11-08", "source": "Mock", "upvotes": "3"}, {"content": "The course was really interesting to go through. All the related assignments whether be Quizzes or the Hands-On really test the knowledge. Kudos to the mentor for teaching us in in such a lucid way. \n", "time": "2020-12-11", "source": "Mock", "upvotes": "3"}, {"content": "This could the single most interesting course amongst all the 5 courses in this specialization. It made Machine Learning easy to interpret and fun to explore for beginners. The assignments are very thorough, though with some autograder issues. I strongly recommend anyone who's interested in ML to take this introductory course to again some knowledge in the different methods and applications of ML in various fields.\n", "time": "2020-11-25", "source": "Mock", "upvotes": "9"}, {"content": "Lectures were good, direct, not too complicated to understand and conceptual. I suggest though that maybe visuals on the lectures could be even better. Assignments were reasonably difficult and forums were great to review the problems and find solutions for the errors. Thank you for this course\n", "time": "2021-01-06", "source": "Mock", "upvotes": "13"}, {"content": "Good class with a lot of interesting material. However consider correcting some issues like, each exam we are told to read file from the folder readonly and each time I got 0/100 at my first submission because the file was not in this folder!! Anyway, quality was present.\n", "time": "2020-11-28", "source": "Mock", "upvotes": "4"}, {"content": "This course provides a brief introduction to many of the vast and dense ML concepts, like Regression, Classification, Clustering, Neural Networks and many more.I took a course by Prof. Andrew ng on Coursera before taking this course. And due to this reason, i was somewhat familiar with the concepts that are being taught in this video.If you are a beginner, i personally recommend you to take Prof. Ng's course on Machine Learning, and then switch to this part of specialisation, by completing the 1st specialisation (2nd is optional but if you are sort of artistic person, and have a habit of visualising things then opt this too). It is best for those who just want a quick recap of some topic.\n", "time": "2020-11-22", "source": "Mock", "upvotes": "8"}, {"content": "This is an excellent course. The programming exercises can be solved only when you get the basics right. Else, you will need to revisit the course material. Also, the forums are pretty interactive.\n", "time": "2020-12-30", "source": "Mock", "upvotes": "1"}, {"content": "This is an excellent course. If you will complete all exercises making sure you complete all questions in each exercise and score almost 100% in each quiz then you will get full value out of course. Deadlines can be reset any time so you can resume courses anytime and you can take your own time as per your schedule. The programming exercises can be solved only when you get the basics right. Else, you will need to revisit the course material. \n", "time": "2021-01-10", "source": "Mock", "upvotes": "0"}, {"content": "A very comprehensive and hands-on course for learning applied Machine Learning. Many thanks for this course. \n", "time": "2020-12-01", "source": "Mock", "upvotes": "10"}, {"content": "Although the course taught me a lot on the importance of parameter tuning and data leakage, I found that often times it was too technical and did not provide the information I was looking for. I found myself continuously referring to notes from other ML courses during the length of this course. In addition, the video errors and challenges with the auto grader were very frustrating.\n", "time": "2020-11-25", "source": "Mock", "upvotes": "8"}, {"content": "I think this course would be a bit challenging to someone who is new to machine learning. The professor often glosses over import details and moves a bit quickly through the course material. There needs to be more powerpoint  and reading material explain what the videos explain. \n", "time": "2020-12-21", "source": "Mock", "upvotes": "13"}, {"content": "Although the course taught me a lot on the importance of parameter tuning and data leakage, I found that often times it was too technical and did not provide the information I was looking for. I found myself continuously referring to notes from other ML courses during the length of this course. In addition, the video errors and challenges with the auto grader were very frustrating.\n", "time": "2020-12-18", "source": "Mock", "upvotes": "3"}, {"content": "I think this course would be a bit challenging to someone who is new to machine learning. The professor often glosses over import details and moves a bit quickly through the course material. There needs to be more powerpoint  and reading material explain what the videos explain. \n", "time": "2020-11-13", "source": "Mock", "upvotes": "16"}, {"content": "This course is an survey on how to implement many machine learning techniques using the SciKit Learn library. Following the course, you can learn several interesting details about how to work in the field, but it is important to take into account that it is not possible to learn the algorithms during the course, since a huge amount of material is covered during a short time; to make the most of the course you have to know them in advance. It bothered me to discover that the course was planned for five weeks but Coursera has reduced it to four, removing the possibility of practicing exercises on unsupervised learning.\n", "time": "2020-12-16", "source": "Mock", "upvotes": "6"}, {"content": "A great introduction to the practical side of machine learning, particularly if you have already taken Andrew Ng's course. It covers a *lot* of material and the pacing is *very* fast. Week 2 is particularly long, and if you are still a student/working it may take an extra week to complete the course. Quizzes and assignments are not terribly difficult, but be careful of the project assignment in Week 4 (though the bar for a 100% is quite low!). Finally, the accompanying Jupyter Notebooks are very helpful and there are many helpful links to outside resources as well.\n", "time": "2020-12-30", "source": "Mock", "upvotes": "6"}, {"content": "A few of the lecture videos feel like an early draft rather than production-quality, with lots of time spent on repeating phrases. The instructor mentions things to be covered \"later,\" but that \"later\" never comes (for example, in discussing Grid Search). For some background, this course appears to have been repeatedly delayed before its release. To me, is understandable that the creators wanted to get this course out given the demand, but the rush is felt.\n", "time": "2020-10-30", "source": "Mock", "upvotes": "0"}, {"content": "Ultimately, however, this is still an excellent introduction to Python Machine Learning, and I do feel the course is well worth taking. Just be prepared to do some more individual learning; however, shouldn't one always be for an online class?)\n", "time": "2021-01-09", "source": "Mock", "upvotes": "14"}, {"content": "Muy agradecido, mis felicitaciones al Profesor Collins-Thompson, se muestra como una persona amable, dinámica y con alto grado de conocimiento, gracias a sus enseñanzas estoy aprendiendo más sobre el proceso de machine learning, siento que aun me falta mucho por recorrer, sin embargo, a lo largo de este curso aprendí los métodos, tipos de modelos, herramientas tanto para clasificación como regresión enfocándome en el área. De igual forma la literatura es muy interesante, se encuentran artículos que al leerlos vas comprendiendo como ha sido el proceso de transformación en este campo y gracias a esto, se me han ocurrido ideas que me gustaría compartir o estructurar para evidenciarlas de manera mas formal. \n", "time": "2020-11-17", "source": "Mock", "upvotes": "9"}, {"content": "Muchas gracias por el apoyo, gracias por las observaciones y anotaciones dentro de los foros de discusión, siento que puedo seguir aprendiendo mas y es por eso que estoy agradecido por mis conocimientos adquiridos, los cuales siempre puedo retroalimentar viendo el curso nuevamente cada vez que lo considere pertinente.\n", "time": "2020-11-10", "source": "Mock", "upvotes": "3"}, {"content": "5 starts for content. The lecturer and slides were good. The assignments were often difficult and took many hours longer than the stated 3-4 hours. Assignment 4 was particularly heavy in time. I finished the course feeling equipped and confident enough to take on straightforward machine learning projects from start to finish. I've dropped a star because the autograder uses an older version of Python and older libraries, which meant I had to spend around 8 hours re-engineering my *correct* code to conform to old libraries.\n", "time": "2020-11-19", "source": "Mock", "upvotes": "0"}, {"content": "Addendum: I've uprated the course to 5 stars after having just completed the fifth, optional week on unsupervised learning. It's unassessed but does give a nice introduction to the subject. Thanks!\n", "time": "2020-12-05", "source": "Mock", "upvotes": "8"}, {"content": "Though I would have liked a bit more insight into the actual algorithms behind machine learning, this class did a great job of giving us problems and forcing us to be resourceful and hunt down the answers, whether via course forums, Stack Overflow or other random Googling. We were exposed to a ton of different algorithms and libraries, and we got to experience the whole spectrum of data science: data importing, cleaning, exploratory analysis, feature selection, model selection, parameter tweaking and even some visualization. It was a lot of fun: challenging at times, but oh so rewarding in the end!\n", "time": "2020-11-03", "source": "Mock", "upvotes": "19"}, {"content": "Very nice class for people who have some intermediate knowledge in Python and who want to dig in, or consolidate their knowledge in Machine Learning. Great overview over scikit-learn, also going into details, and I also appreciated the part of the class about model evaluation. First week might seem not overly difficult, but the intensity of the class ramps up significantly in week 2. For me the level was challenging enough, without being overwhelming. I enjoyed taking this class and obtaining my certification at the end was a very nice reward. A big thank you to University of Michigan.\n", "time": "2020-11-29", "source": "Mock", "upvotes": "18"}, {"content": "The course was great. The final assignment was especially useful as it was almost completely unguided and gave us a dataset which is unlike the tidied up, dummy datasets you'd find in online courses. So it was, by some means, an independent project. The data was messy, full of errors, and maybe downright ugly. We needed to clean the data and do quite a bit of preprocessing to get it in a shape suitable for fitting a machine learning model. The project gave a taste of how a real-world machine learning project might be taken on. Thank you very much, Professor Collins-Thompson!\n", "time": "2020-11-14", "source": "Mock", "upvotes": "3"}, {"content": "I completed the Machine Learning Specialization Certificate before taking this course. This course is an excellent applied course that quickly gets into the key aspects of using sklearn. This course is ideal for both new learners and experienced learners who just want to learn more/revise about machine learning. For the final assignment, it requires substantial data cleaning techniques covered in Course 1 in this specialisation. Overall, I feel very comfortable with using Python for any reasonable size of machine learning problems after taking this course.\n", "time": "2020-11-18", "source": "Mock", "upvotes": "15"}, {"content": "The class provides a perfect introduction to the scikit-learn Python module. The videos are engaging and insightful. The quizzes are challenging while not requiring too much time writing out solutions (it does take time finding some of the more subtle answers, by reviewing details in the videos). The executable modules are perfect to bootstrap machine learning projects. Homework assignments can get complicated, and you should be familiar with advanced data structure manipulation in pandas and numpy to make progress. Assignment grading is very well done.\n", "time": "2020-11-16", "source": "Mock", "upvotes": "20"}, {"content": "Great course on the basics of machine learning. I'd say this course is a great dive into sklearn, which is actually great for many purposes. It barely covers Neural networks, which are the hot topic right now, but it gives you a lot of tools that will suffice in the vast majority of cases, and teaches fundamentals that are also applied to deep learning if one decides to go forward and learn other libraries like tensorflow. All in all, a great addition to anyone's toolbelt, be it engineers, scientists or people trying to jump to a data science career.\n", "time": "2021-01-11", "source": "Mock", "upvotes": "2"}, {"content": "Excellent course for Machine Leaning. Discusses wide range of Supervised machine learning and gives a very brief introduction on Clustering algorithms(Unsupervised). Users can immediately put to use the knowledge gained during the course. \n", "time": "2020-11-08", "source": "Mock", "upvotes": "4"}, {"content": "Some more briefing about feature transformation and other such elements can be included in the course material to make it better. Also unsupervised machine learning could have been included with grater depth. Overall this course is highly recommended to aspirants interested in ML with some python knowledge.\n", "time": "2021-01-08", "source": "Mock", "upvotes": "19"}, {"content": "The course was very well prepared and the instructor presented the material clearly and informatively. I've seen some courses where you spend more time trying to understand and keep up with the instructor. In this instance, this was not the case and you could spend more time understanding the material. The instructor spoke slowly and clearly.\n", "time": "2020-10-12", "source": "Mock", "upvotes": "19"}, {"content": "I do have to say I purchased the corresponding book as recommended but I didn't feel it was necessary. Good book, I just think the material in the course was presented well enough on its own.\n", "time": "2020-10-25", "source": "Mock", "upvotes": "0"}, {"content": "The course provides a good overview of ML techniques and potential gotchas, and then goes into a real life example which helps round up the theoretical overview with application to real world data and their challenges.  This provides a great introduction to ML which positions you to delve into it in much more detail and help in your journey as a Data Science practitioner. Must commend University of Michigan on coming up with the fine balance of theory and practice, which is essential in this rapidly changing space.\n", "time": "2020-12-13", "source": "Mock", "upvotes": "9"}, {"content": "The course is very well-designed, with the first three weeks learning basic know-hows of all the tools we need, and the fourth week make full use of every model we've learned.\n", "time": "2020-11-15", "source": "Mock", "upvotes": "16"}, {"content": "I thank Dr. Kevyn Collins-Thompson and Coursera team for the excellent course. I have learned valuable skills from the course. Dr. Thompson explained ML concepts very skillfully and made the course fun to follow. Assignments are very well selected and reinforce the class concepts. Over-all the course encourages learner to investigate and apply different ways to do same task.  I recommend this course to those who are willing to learn machine learning and can't decide where to start. \n", "time": "2020-12-07", "source": "Mock", "upvotes": "10"}, {"content": "A solid course. The help found in the forums was also way more useful than the first course in this series. While course two was generically useful, this third course was technically useful. A very good introduction into sklearn. The video instructor/professor was also very clear and methodical in presentation. The assistance by the class monitors was leaps and bounds more useful in this course than course one (I almost quit after course one because of it, so glad I didn't!)\n", "time": "2020-12-05", "source": "Mock", "upvotes": "16"}, {"content": "Great course filled with a lot of details. The course does a great job in teaching all the important concepts. I felt the feature engineering should have been a dedicated topic. I got a lot of hints from the discussion forum and surprisingly there are even more concepts you have to learn for building a pipeline, treating categorical and numeric features differently. Overall challenging week4 assignment gives you confidence to deal with real world problem. \n", "time": "2020-12-13", "source": "Mock", "upvotes": "3"}], "word_cloud": [["course", 98], ["learning", 40], ["machine", 32], ["assignment", 21], ["lot", 17], ["material", 15], ["great", 15], ["time", 15], ["lecture", 14], ["class", 12], ["take", 12], ["video", 12], ["many", 11], ["week", 11], ["ml", 11], ["data", 11], ["concept", 10], ["learn", 10], ["python", 9], ["detail", 9], ["get", 9], ["de", 9], ["good", 8], ["one", 8], ["introduction", 8], ["professor", 7], ["go", 7], ["need", 7], ["like", 6], ["using", 6]]}