{"course": "murphy", "comments": [{"content": "The most frustrating learning experience I have ever had. I should not have to google for 70% of what should be taught in the lessons. Quizzes and exercises use material not covered in the lectures. \n", "time": "2020-10-09", "source": "Coursera", "upvotes": 2}, {"content": "The first 3 weeks of the course were great.   It really helped change my way of thinking to solve large complex problems.   I can use this in my role as a Business Analyst.\n", "time": "2021-01-12", "source": "Coursera", "upvotes": 3}, {"content": "The lecturers presented the materials in a clear manner, with real life examples to help the understanding.  \n", "time": "2020-12-04", "source": "Coursera", "upvotes": 11}, {"content": " Then, came the python coding.   The first few modules of the Python section were fine.   Then came section 4.7  It was a lot more difficult than the others, and I found that the helpdesk was slow to respond.   It took longer than it should have to complete that section, but I pressed on.\n", "time": "2020-10-19", "source": "Coursera", "upvotes": 19}, {"content": "Then, there was the final test.  Section 4.8.  There were some concepts in this exam that were not included in the lecture material.  The online help was non-existent.  It took DAYS to get a response from the TA in the discussion group.  Even then, the response was not particularly helpful.    We were then told to send a problem flag to review the code (since we were not allowed to share the code in the discussion group.)   I submitted a problem ticket a week ago, and still have not received a response.  Keep in mind that I'm not a developer.  \n", "time": "2020-12-29", "source": "Coursera", "upvotes": 11}, {"content": "I found help in other places, and was finally able to complete the assignment.    It's a shame that the problems with the last section of the course seemed to take away from what was otherwise an excellent course.  \n", "time": "2021-01-16", "source": "Coursera", "upvotes": 7}, {"content": "The course is generally good. However, the assignment content and the lecture are not really getting along, especially the Python part. I suggest more \"bridging\" materials. \n", "time": "2020-11-29", "source": "Coursera", "upvotes": 12}, {"content": "This course surprised me. As a programmer by trade these are my thoughts...\n", "time": "2021-01-16", "source": "Coursera", "upvotes": 20}, {"content": "Week 1 (Problem Solving) - Good for beginners (and scatter brained intermediates).\n", "time": "2020-10-26", "source": "Coursera", "upvotes": 2}, {"content": "Week 2 (Algorithms) - This was interesting and professionally useful. Algorithms include: Linear, binary, greedy, and brute force.\n", "time": "2021-01-13", "source": "Coursera", "upvotes": 12}, {"content": "Week 3 (Computer Architecture) - Basic outline of how the cpu deals with information and a brief history of computing. Overall not professionally useful, but interesting.\n", "time": "2020-10-13", "source": "Coursera", "upvotes": 20}, {"content": "Week 4 (Python Programming) - Brief intro to python and applying what you have learned by writing python scripts. This was the easiest module for me (and probably for anyone with coding experience).\n", "time": "2020-10-21", "source": "Coursera", "upvotes": 8}, {"content": "I thought this course was excellent except for a few small things. I've done a handful of online \"learn to code\" courses and this was by far the best one to help understand the foundations and actually what you are doing when you code. The videos were really helpful as well as the assignments which I thought were a good balance of challenging but not too challenging. There were two specific things I didn't like as much, particularly the quizzes at the end of each lecture and the format of the delivery of the assignments. I thought that the quizzes were so short that they didn't deliver a ton of value. With respect to the assignments, I thought that the assignments themselves were excellent but the long multi-page PDFs for each coding assignment were overwhelming and often had details buried within them that were really important. I'd recommend a short bulleted summary of requirements up at the top or something to make it clearer. Other than that, I thought this was an excellent course!\n", "time": "2020-11-05", "source": "Coursera", "upvotes": 13}, {"content": "Everyone will not be able to complete this since it does not offer additional resources that are relevant to the assignments.  I tried and will not finish as it has become to time-consuming. I am learning however, there are not examples or help for you if you do not understand the instructions.\n", "time": "2020-10-16", "source": "Coursera", "upvotes": 13}, {"content": "Really great course. The professors do an amazing job teaching the fundamentals that can be transferred across all of computer science. Instead of learning one programming language, they instead teach you how to think like a computer scientist, which is far more valuable because it will enable you to \"connect the dots\" from one language to the next.\n", "time": "2020-10-16", "source": "Coursera", "upvotes": 6}, {"content": "I had a HORRIBLE experience. This course was suggested by my school as pre-study material. I did learn some information, which matters the most. I ended up finding an online tutoring service which was teaching me in week 4...which cost $100. I probably wouldn't have had to get the tutor if the discussion threads were even a little bit useful. Honestly that was the most frustrating part. The staff has 48 hours to respond .... if they even do (I had my last post deleted by the staff). I believe I posted 3 times in the threads for assistance, The responses I did receive were not the least bit helpful. Next complaint, the homework said it should take 20 minutes to complete. Nothing ever took me 20 minutes to complete, more like 5-6+ hours minimum. Then peer reviewed assignments. How am I grading someones assignment when I barely understood what I was doing myself.\n", "time": "2020-11-15", "source": "Coursera", "upvotes": 19}, {"content": "Overall, great. However, I think the programming assignments were too hard to just do right off of the lectures. Needed extra research.\n", "time": "2020-11-22", "source": "Coursera", "upvotes": 16}, {"content": "Impossible to get any feedback.  Very hard to follow what the requirements are at the end.\n", "time": "2021-01-11", "source": "Coursera", "upvotes": 9}, {"content": "Disappointing, frustrating course. The professors are likeable and engaging and the videos are well done, but I found this to be an unpleasant learning experience for the following reasons: 1. The videos are very brief and rush through details without enough background explanation or elaboration. 2. The quizzes test you on things that were mentioned in one sentence or less in the video, and seem designed just to trip you up rather than help you learn by quizzing you on the main points in the lecture. 3. The peer review projects don't always correspond to the lecture. All of a sudden you are doing an assembly language project, for example, with no prior instruction. And unlike peer-review projects in other online courses, the rubric and grading instructions are very picky: You need to not just demonstrate that you understand the concepts, you need to do the project perfectly, in the way a computer scientist professor with years of experience would. There are too many of these projects, too. 4. The Python module/week tries to cover in one week the material that beginning Python courses would cover over many weeks or months, and it is all done from the vantage point of an experienced, advance programmer. (If you want to learn Python, start with Dr. Chuck!)\n", "time": "2021-01-14", "source": "Coursera", "upvotes": 20}, {"content": "I suspect that the fundamental problem with this course is \"the Curse of Knowledge.\" The creators of the course have been doing this for so long, at such a high level, that they truly don't understand the perspective of a beginner. The concepts are so basic, so obvious to them. The math so self-explanatory. So the material is delivered in a rush, with the assumption that it will be equally obvious and clear to everyone. \n", "time": "2021-01-06", "source": "Coursera", "upvotes": 10}, {"content": "Great course. Good mixture of video lectures, quizzes, and peer graded assignments. Four stars because in some of the assignments it was unclear as to what was being asked or required until you saw the rubric for the first time. I think some items that were asked for in the rubrics were not obvious/inferable from the prompts.\n", "time": "2020-12-26", "source": "Coursera", "upvotes": 8}, {"content": "Thank you, Susan and Chris, for making this course! I took this course for free so I didn't have access to things like quiz grades or have the ability to submit assignments. I still did the quizzes and I made sure the code worked on the assignments so I think you don't need to pay for this course if you just want to learn. I appreciate that the instructors progressed from easy to gradually harder material until I was making complex algorithms (well, complex compared to what we started with). This course gave me an appreciation for computational thinking and I'm entirely convinced that this will be an important skill that everyone should have for humans to progress. I already have ideas to use computational thinking to improve my job as a kitchen cleaner for myself and others who take this job after I'm done with it. I plan to learn more about coding so that I can solve more problems. Thanks again for making this course available online for free. \n", "time": "2020-11-14", "source": "Coursera", "upvotes": 1}, {"content": "I loved this course on computational thinking. Unlike other courses which focused only on a specific programming language (such as Python), this course gave me a deep dive into computational thinking,  a foundation learning, behind any types of programming. Not having a computer science background, but having done some Python experience, I lacked the basic concepts of computational thinking. This course provided just that! It covered pillars of computational thinking, simple algorithms, flowcharts, pseudocode, memory usage in CPU as it relates to programming concepts, and introduction to Python. The course includes several quizzes, but most importantly, great assignments that helped me solidify my understanding of the course material. A highly recommend this course even if you have not worked with any programming languages before! \n", "time": "2020-10-12", "source": "Coursera", "upvotes": 3}, {"content": "P.S. If you have never worked with Python before, I would recommend keeping aside some extra time during Week 4.\n", "time": "2020-11-24", "source": "Coursera", "upvotes": 3}, {"content": "Thank you very much for introducing me to the world of Computer Science! Having nothing to do with Computer Science before, I took this course as it sounded very interesting and I thought it may be something I can take interest in. I am looking for a career change and the worst thing for me was not to completely understand what kind of job I would enjoy doing other than teaching, or real estate. I am happy my research led me to this amazing course that introduces people just like me to some basic ideas of Computer Science. My goal is to enroll into the MCIT ONLINE program, this program sounds very interesting to me especially after taking this course. Thank you very much for coming up with the idea of creating Computational Thinking course and the degree for people with non-Computer Science background!\n", "time": "2020-11-20", "source": "Coursera", "upvotes": 20}, {"content": "I highly recommend taking this course, whether you are aspiring to be a developer,  looking for a better way to solve problems at your job or school, or are interested in computational thinking. I apply concepts from this course - drawing flow charts and writing pseudocode - at my job as a Salesforce Admin and noticed that I can solve harder problems quicker. The only thing that did not work out for me a couple of times was that assignments are peer-graded. As a result, I failed two assignments on a first try when I was positive that my solutions were correct. If that happens to you, just make sure that you resubmit the assignment and eventually one of the peers who understand your solution will be able to grade it correctly. \n", "time": "2020-11-08", "source": "Coursera", "upvotes": 19}, {"content": "Many thanks to the instructors and the team who put this class together!\n", "time": "2020-10-29", "source": "Coursera", "upvotes": 8}, {"content": "I really enjoyed the course; however, I feel the last module (week 4 / phyton) does not have enough explanations and examples in order to properly complete the assignments. I had to research on my own and complete phyton trainings at other sites in order to successfully complete the projects. Thanks for the course and I look forward to applying to MCIT.  \n", "time": "2020-12-31", "source": "Coursera", "upvotes": 10}, {"content": "Great course! The python in week 4 can be incredibly challenging to those who have no prior experince in coding. There are times that it felt like the course didn't properly cover certain functions or code that would have made the assignments much easier. However, the overall instruction and semi-gentile emersion into computer science are excellent. \n", "time": "2021-01-10", "source": "Coursera", "upvotes": 6}, {"content": "Finally Professors that know how to teach over video. Easy to digest examples, study cases with cc explaining how the voice over relates to the theory. It seems the University of Penn has entered the online course market to make a difference. \n", "time": "2020-10-24", "source": "Coursera", "upvotes": 6}, {"content": "Excellent course for beginners with enough depth, programming and computational theory to increase their computer science knowledge to a higher level. It builds a good foundation of how computers work \n", "time": "2020-10-17", "source": "Coursera", "upvotes": 13}, {"content": "A really well-taught course by astute professors. Its assignments are to the point and not much abstract with good amount of challenging questions especially the last module of the course\n", "time": "2020-11-28", "source": "Coursera", "upvotes": 19}, {"content": "Very well thought out. This course covers simple concepts while still being engaging and challenging. Examples from varying disciplines help illustrate concepts in a real-life context.\n", "time": "2020-11-11", "source": "Coursera", "upvotes": 1}, {"content": "Course content is good, graded assignments are good, I just had problems with my assignments in week 4 as I easily became confused with the implementation of all the lessons combined.\n", "time": "2020-11-11", "source": "Coursera", "upvotes": 19}, {"content": "An excellent bridge into introductory computer science topics. Professors Susan Davidson and Chris Murphy exposed learners to computer science concepts within everyday problems. \n", "time": "2020-12-19", "source": "Coursera", "upvotes": 13}, {"content": "Thoroughly enjoyed the course. If you are new to computer science or need a refresher of the basic concepts you learned in high school / college, this is the perfect course\n", "time": "2020-12-19", "source": "Coursera", "upvotes": 4}, {"content": "Enjoyed the learning and the structure of the course. Felt like I got a good introduction to Python. Learned a bunch about algorithms. I marked a star off because the online grading sometimes was vague. Additionally, it took a while to get feedback. I had a bit of programming experience, so I didn't have a huge challenge, but I can imagine if you are totally new, the assignments are really hard. It would be difficult to get the help and feedback that you need on their online forum system. \n", "time": "2020-11-06", "source": "Coursera", "upvotes": 10}, {"content": "the auto-grader for programming assignments can be a bit unforgiving at times, but the course is challenging and thorough for a month-long course. Would recommend. To improve experience with the auto grader some more hints in the assignment page could help, for example offering some explanation of the return function before, rather than after, a quiz that required its use.\n", "time": "2020-10-27", "source": "Coursera", "upvotes": 0}, {"content": "I really enjoy the online session.  It gives a preview of what MCIT would look like.  Having said that, I would suggest to extend the week 4 session to two-week long and explain Python in greater detail.  Since most students are new to coding, people are struggling including myself.\n", "time": "2020-12-07", "source": "Coursera", "upvotes": 6}, {"content": "The course is great. I learned a lot. The support for the course is SUPER slow. It's hard to get any direct help for any questions or issues that you are having. Beware of assignment 4.7! \n", "time": "2020-12-17", "source": "Coursera", "upvotes": 3}, {"content": "Great! I learned the value of planning before coding. However, I would like this course to be more challenging.\n", "time": "2020-11-15", "source": "Coursera", "upvotes": 17}, {"content": "could benefit from more active assistance with assignments, especially section 4\n", "time": "2020-11-21", "source": "Coursera", "upvotes": 3}, {"content": "The content is good. But it's hard to get feedback from TA.\n", "time": "2020-11-09", "source": "Coursera", "upvotes": 17}, {"content": "This was definitely a very frustrating course. Most, if not all,  assignments were not built on the video lectures. The phrasing of questions and  instructions were confusing at times. I think the most frustrating thing of all was the time it took me to google all the \"knowledge\" that were necessary to complete the assignments, because they were not taught in the course at all. This was an introductory course to see if I would like the Master's degree that they are offering, but after this course, I don't think I would enjoy it. I think it is a good course, but there is definitely room for improvement. \n", "time": "2020-10-27", "source": "Coursera", "upvotes": 12}, {"content": "week 4 is impossible to complete with the knowledge they provide.The first three weeks were nice\n", "time": "2020-11-05", "source": "Coursera", "upvotes": 1}, {"content": "The last week of coding projects were well above what was taught in the course. The other weeks answers to the quizzes and projects could be understood through watching videos provided. The coding projects required more research outside of the class and I also needed two different tutors. I would not recommend this course or any other course through university of Penn solely based on this experience. I did reach out to a TA and received a response within 12 hours. \n", "time": "2020-11-30", "source": "Coursera", "upvotes": 5}, {"content": "The instruction -- as well as production quality -- of the course was outstanding, the course was very well paced and laid out, with each new week building upon learned concepts from the previous. I had done some online tutorials in various coding languages in the past, but this course is different in that it devotes the majority of the time to really break down a problem and think about it -- computationally -- before writing a single line of code. This made the final portion of the course, implementing the solution in Python, so much more rewarding, enjoyable and fun. It all came together and I just felt so satisfied seeing the results.\n", "time": "2020-12-23", "source": "Coursera", "upvotes": 16}, {"content": "The instructors (Chris Murphy and Susan Davidson) did a truly outstanding job explaining each concept and walking through examples to reinforce -- and both even threw in some humor for good measure, which helped to soften a very scientific and stereotyped field. \n", "time": "2020-10-13", "source": "Coursera", "upvotes": 2}, {"content": "This course was a great intro for those questioning whether or not they are truly interested in Comp Sci, as it makes you take a simple everyday problem and think about it in a computational way. There are thousands of coding tutorials online but I would highly recommend taking this course first as it acts as almost a primer to getting your thought process in the right mindset before even looking at a programming language. \n", "time": "2020-10-19", "source": "Coursera", "upvotes": 20}, {"content": "Dr. Davidson and Dr. Murphy provide an excellent introductory course on how to think like a computer scientist.   The course was perfect for me as I am looking to change careers from natural scientist to computer scientist.  As I have some computer science background, part of the course was a refresher, but it was never boring or patronizing.  The course is highly organized and grading is either peer-based or automatic.  The discussion forums as well as staff-produced hints were very helpful.  I highly recommend Computational Thinking for Problem Solving for anyone who is looking at moving into the computer science field, or just wants to be able to use computer science principles when approaching problems in their own field.\n", "time": "2020-12-02", "source": "Coursera", "upvotes": 13}, {"content": "The first three weeks of the course were excellent, especially the way in which algorithms are explained. Students then have the opportunity to gain experience via various assignments. The issue for me came in week 4. While the assignments at face value were not overly complex, completing them took more time than they should have. That is due partially to having to conduct research outside of the course materials in order to accomplish the objective. If this was made clear in the instructions it would have been less of an issue. Otherwise, I thoroughly enjoyed the instructors,  and the TA was very responsive to questions/problems. \n", "time": "2020-12-11", "source": "Coursera", "upvotes": 20}, {"content": "This course is perfect for introducing those without a Computer Science background to the world of CS! By the end of the course you will be writing your own code. The professors are absolutely AMAZING and the effort put into designing this course is evident in each Lesson. I found that the material was clear, easy to understand, and incredibly useful. It teaches how to think in a computational way that is both holistic and streamlined. Overall, this was a fun, informative, and motivating course that I would HIGHLY recommend to everyone! I would take it again if I wasn't so excited to learn more Python!\n", "time": "2020-10-30", "source": "Coursera", "upvotes": 13}, {"content": "Excellent course for anyone with no prior experience in programming (or very basic, as was my case). It shows how to apply structured thinking to problem-solving, whether in a computational or an everyday situation. The assignments and exercises were great, and in some cases, you learn by reviewing other people's work. I finally learned how to program in Python (at least the basics), something I've been wanting for a long time! Congratulations to the University of Pennsylvania for creating this high-quality online course. Now I hope to keep learning more about this subject.\n", "time": "2020-12-14", "source": "Coursera", "upvotes": 17}, {"content": "I overthought several parts towards the beginning just based on my experience, and wish a couple of questions were more clear (e.g. is modifying a variable and reassigning a variable to a different value the same thing? in part 3). I had had someone grading it that was more experienced and spoke my language natively (and I'm sure the feelings are mutual!) but even though I've been studying Python for a few months I learned a few things, especially in the parts on machine language, and also that putting ideas in flowchart form is a good way to impose rigor on one's ideas. \n", "time": "2021-01-01", "source": "Coursera", "upvotes": 1}, {"content": "I've done several intro-level courses In Python programming before but this Is by far the most systematic Introduction to programming I have taken. Even though we didn't do any real programming until week 4 of the course, everything leading up to actual programming was every bit as valuable as learning the actual strokes of programming Itself, If not more valuable as It recalibrates ones brain to break from the normal patterns of Intuitive thinking. I can't wait to begin using what I learned on the job and learn more programming concepts.\n", "time": "2020-10-31", "source": "Coursera", "upvotes": 4}, {"content": "Unlike other MOOC programming courses offered, this one teaches you how to think instead of how to follow step by step tutorial. Background in programming would be a very nice thing to have, and homework and projects would be quite challenging for those without prior exposure. The course could be really improved by offering more programming exercises and perhaps more test cases to debug student assignments. Overall, I think this is a good intro course, even for those who already have a background in programming.\n", "time": "2021-01-02", "source": "Coursera", "upvotes": 19}, {"content": "This is an exciting course to take and if you are persistent you shall succeed.  It really made me flex my brain muscles.  This course made me realise how much I love the IT field and gives me motivation to return to this field professionally.  I look forward to taking more courses with UPenn.  Also, the Teaching Staff gave excellent advice on solving one of my issues in coding.  It required no clarification once I took a second revisit at his comments.  Thank you for this experience.\n", "time": "2020-12-30", "source": "Coursera", "upvotes": 18}, {"content": "Compelling lectures paired with practical implementations to reinforce computer science concepts forwarded by Professor Davidson and Professor Murphy makes this course truly stand out among my 5 years of graduate education. The online context allows for both efficient and expedient learning accessible to anyone with an internet connection. I've already began to contrive solutions to real world problems I face daily as a physician using the knowledge acquired from this course. 5/5. \n", "time": "2020-12-26", "source": "Coursera", "upvotes": 19}], "word_cloud": [["course", 88], ["assignment", 35], ["week", 24], ["computer", 22], ["programming", 22], ["python", 20], ["would", 19], ["problem", 18], ["science", 16], ["4", 15], ["online", 14], ["good", 14], ["experience", 13], ["concept", 13], ["think", 13], ["computational", 13], ["thinking", 12], ["coding", 12], ["time", 12], ["material", 11], ["excellent", 11], ["like", 11], ["lecture", 10], ["great", 10], ["help", 10], ["complete", 10], ["thing", 10], ["one", 10], ["project", 10], ["learning", 9], ["took", 9], ["thought", 9], ["learned", 9], ["recommend", 9], ["professor", 9], ["language", 9], ["quiz", 8], ["example", 8], ["code", 8], ["learn", 8], ["video", 8], ["challenging", 8], ["job", 8], ["way", 7], ["get", 7], ["take", 7], ["basic", 7], ["done", 7], ["understand", 7], ["instruction", 7], ["peer", 7], ["background", 7], ["section", 6], ["part", 6], ["much", 6], ["made", 6], ["frustrating", 5], ["use", 5], ["3", 5], ["clear", 5], ["real", 5], ["module", 5], ["response", 5], ["last", 5], ["algorithm", 5], ["overall", 5], ["make", 5], ["scientist", 5], ["grading", 5], ["research", 5], ["need", 5], ["knowledge", 5], ["idea", 5], ["looking", 5], ["question", 5], ["field", 5], ["solve", 4], ["complex", 4], ["came", 4], ["found", 4], ["ta", 4], ["discussion", 4], ["helpful", 4], ["able", 4], ["solving", 4], ["interesting", 4], ["useful", 4], ["intro", 4], ["writing", 4], ["anyone", 4], ["two", 4], ["value", 4], ["everyone", 4], ["teaching", 4], ["bit", 4], ["staff", 4], ["5", 4], ["hard", 4], ["prior", 4], ["required", 4], ["instructor", 4], ["people", 4], ["taking", 4], ["solution", 4], ["enjoyed", 4], ["case", 4], ["davidson", 4], ["new", 4], ["could", 4], ["issue", 4], ["taught", 3], ["lesson", 3], ["exercise", 3], ["helped", 3], ["change", 3], ["first", 3], ["test", 3], ["review", 3], ["since", 3], ["content", 3], ["beginner", 3], ["brief", 3], ["foundation", 3], ["end", 3], ["detail", 3], ["within", 3], ["something", 3], ["amazing", 3], ["valuable", 3], ["school", 3], ["hour", 3], ["without", 3], ["enough", 3], ["explanation", 3], ["point", 3], ["unlike", 3], ["rubric", 3], ["many", 3], ["cover", 3], ["month", 3], ["want", 3], ["dr", 3], ["high", 3], ["level", 3], ["obvious", 3], ["graded", 3], ["thank", 3], ["susan", 3], ["chris", 3], ["making", 3], ["sure", 3], ["worked", 3], ["easy", 3], ["gave", 3], ["thanks", 3], ["simple", 3], ["introduction", 3], ["several", 3], ["world", 3], ["enjoy", 3], ["mcit", 3], ["program", 3], ["whether", 3], ["work", 3], ["order", 3], ["look", 3], ["felt", 3], ["teach", 3], ["university", 3], ["introductory", 3], ["everyday", 3], ["perfect", 3], ["feedback", 3], ["offering", 3], ["student", 3], ["different", 3], ["based", 3], ["tutorial", 3], ["google", 2], ["covered", 2], ["life", 2], ["understanding", 2], ["7", 2], ["lot", 2], ["difficult", 2], ["others", 2], ["slow", 2], ["respond", 2], ["final", 2], ["non", 2], ["group", 2], ["received", 2], ["keep", 2], ["developer", 2], ["getting", 2], ["suggest", 2], ["programmer", 2], ["1", 2], ["2", 2], ["cpu", 2], ["information", 2], ["applying", 2], ["specific", 2], ["short", 2], ["page", 2], ["important", 2], ["requirement", 2], ["fundamental", 2], ["next", 2], ["study", 2], ["tutor", 2], ["thread", 2], ["assistance", 2], ["least", 2], ["homework", 2], ["said", 2], ["20", 2], ["minute", 2], ["nothing", 2], ["someone", 2], ["understood", 2], ["right", 2], ["needed", 2], ["extra", 2], ["impossible", 2], ["follow", 2], ["engaging", 2], ["rush", 2], ["le", 2], ["year", 2], ["try", 2], ["beginning", 2], ["experienced", 2], ["star", 2], ["asked", 2], ["free", 2], ["grade", 2], ["harder", 2], ["improve", 2], ["provided", 2], ["pseudocode", 2], ["relates", 2], ["introducing", 2], ["career", 2], ["creating", 2], ["degree", 2], ["interested", 2], ["couple", 2], ["result", 2], ["put", 2], ["class", 2], ["phyton", 2], ["function", 2], ["explaining", 2], ["theory", 2], ["penn", 2], ["context", 2], ["implementation", 2], ["refresher", 2], ["auto", 2], ["grader", 2], ["long", 2], ["hint", 2], ["return", 2], ["session", 2], ["give", 2], ["provide", 2], ["three", 2], ["nice", 2], ["outside", 2], ["quality", 2], ["outstanding", 2], ["various", 2], ["break", 2], ["fun", 2], ["reinforce", 2], ["face", 2], ["variable", 2], ["though", 2], ["actual", 2], ["brain", 2], ["using", 2], ["step", 2], ["70", 1], ["large", 1], ["role", 1], ["business", 1], ["analyst", 1], ["lecturer", 1], ["presented", 1], ["manner", 1], ["fine", 1], ["longer", 1], ["pressed", 1], ["8", 1], ["exam", 1], ["included", 1], ["existent", 1], ["day", 1], ["told", 1], ["send", 1], ["flag", 1], ["allowed", 1], ["share", 1], ["submitted", 1], ["ticket", 1], ["mind", 1], ["place", 1], ["shame", 1], ["seemed", 1], ["away", 1], ["bridging", 1], ["surprised", 1], ["trade", 1], ["scatter", 1], ["brained", 1], ["intermediate", 1], ["include", 1], ["linear", 1], ["binary", 1], ["greedy", 1], ["brute", 1], ["force", 1], ["architecture", 1], ["outline", 1], ["deal", 1], ["history", 1], ["computing", 1], ["script", 1], ["easiest", 1], ["except", 1], ["small", 1], ["handful", 1], ["best", 1], ["balance", 1], ["format", 1], ["delivery", 1], ["deliver", 1], ["ton", 1], ["respect", 1], ["multi", 1], ["pdfs", 1], ["overwhelming", 1], ["buried", 1], ["bulleted", 1], ["summary", 1], ["top", 1], ["clearer", 1], ["offer", 1], ["additional", 1], ["resource", 1], ["relevant", 1], ["tried", 1], ["finish", 1], ["become", 1], ["consuming", 1], ["transferred", 1], ["across", 1], ["enable", 1], ["connect", 1], ["dot", 1], ["horrible", 1], ["suggested", 1], ["pre", 1], ["matter", 1], ["ended", 1], ["finding", 1], ["tutoring", 1], ["service", 1], ["cost", 1], ["100", 1], ["little", 1], ["48", 1], ["post", 1], ["deleted", 1], ["believe", 1], ["posted", 1], ["receive", 1], ["complaint", 1], ["6", 1], ["minimum", 1], ["reviewed", 1], ["disappointing", 1], ["likeable", 1], ["unpleasant", 1], ["following", 1], ["reason", 1], ["elaboration", 1], ["mentioned", 1], ["sentence", 1], ["seem", 1], ["designed", 1], ["trip", 1], ["quizzing", 1], ["main", 1], ["correspond", 1], ["sudden", 1], ["assembly", 1], ["picky", 1], ["demonstrate", 1], ["vantage", 1], ["advance", 1], ["start", 1], ["chuck", 1], ["suspect", 1], ["curse", 1], ["creator", 1], ["perspective", 1], ["math", 1], ["self", 1], ["explanatory", 1], ["delivered", 1], ["assumption", 1], ["mixture", 1], ["four", 1], ["unclear", 1], ["saw", 1], ["item", 1], ["inferable", 1], ["prompt", 1], ["access", 1], ["ability", 1], ["submit", 1], ["pay", 1], ["appreciate", 1], ["progressed", 1], ["compared", 1], ["started", 1], ["appreciation", 1], ["convinced", 1], ["skill", 1], ["human", 1], ["progress", 1], ["kitchen", 1], ["cleaner", 1], ["plan", 1], ["available", 1], ["loved", 1], ["focused", 1], ["deep", 1], ["dive", 1], ["behind", 1], ["type", 1], ["lacked", 1], ["pillar", 1], ["flowchart", 1], ["memory", 1], ["usage", 1], ["includes", 1], ["solidify", 1], ["p", 1], ["keeping", 1], ["aside", 1], ["sounded", 1], ["may", 1], ["interest", 1], ["worst", 1], ["kind", 1], ["estate", 1], ["happy", 1], ["led", 1], ["introduces", 1], ["goal", 1], ["enroll", 1], ["sound", 1], ["coming", 1], ["aspiring", 1], ["better", 1], ["apply", 1], ["drawing", 1], ["flow", 1], ["chart", 1], ["salesforce", 1], ["admin", 1], ["noticed", 1], ["quicker", 1], ["failed", 1], ["positive", 1], ["correct", 1], ["happens", 1], ["resubmit", 1], ["team", 1], ["together", 1], ["feel", 1], ["training", 1], ["site", 1], ["experince", 1], ["certain", 1], ["easier", 1], ["semi", 1], ["gentile", 1], ["emersion", 1], ["know", 1], ["digest", 1], ["cc", 1], ["voice", 1], ["seems", 1], ["entered", 1], ["market", 1], ["difference", 1], ["depth", 1], ["increase", 1], ["higher", 1], ["astute", 1], ["abstract", 1], ["amount", 1], ["varying", 1], ["discipline", 1], ["illustrate", 1], ["became", 1], ["confused", 1], ["combined", 1], ["bridge", 1], ["topic", 1], ["exposed", 1], ["learner", 1], ["college", 1], ["structure", 1], ["got", 1], ["bunch", 1], ["marked", 1], ["vague", 1], ["huge", 1], ["challenge", 1], ["imagine", 1], ["forum", 1], ["system", 1], ["unforgiving", 1], ["thorough", 1], ["preview", 1], ["extend", 1], ["greater", 1], ["struggling", 1], ["including", 1], ["support", 1], ["super", 1], ["direct", 1], ["beware", 1], ["planning", 1], ["benefit", 1], ["active", 1], ["built", 1], ["phrasing", 1], ["confusing", 1], ["necessary", 1], ["see", 1], ["master", 1], ["room", 1], ["improvement", 1], ["answer", 1], ["watching", 1], ["reach", 1], ["12", 1], ["production", 1], ["paced", 1], ["laid", 1], ["building", 1], ["upon", 1], ["previous", 1], ["past", 1], ["devotes", 1], ["majority", 1], ["single", 1], ["line", 1], ["portion", 1], ["implementing", 1], ["rewarding", 1], ["enjoyable", 1], ["satisfied", 1], ["seeing", 1], ["walking", 1], ["threw", 1], ["humor", 1], ["measure", 1], ["soften", 1], ["scientific", 1], ["stereotyped", 1], ["questioning", 1], ["comp", 1], ["sci", 1], ["thousand", 1], ["act", 1], ["primer", 1], ["process", 1], ["mindset", 1], ["natural", 1], ["boring", 1], ["patronizing", 1], ["organized", 1], ["either", 1], ["automatic", 1], ["produced", 1], ["moving", 1], ["principle", 1], ["approaching", 1], ["explained", 1], ["opportunity", 1], ["gain", 1], ["via", 1], ["completing", 1], ["due", 1], ["conduct", 1], ["accomplish", 1], ["objective", 1], ["responsive", 1], ["c", 1], ["effort", 1], ["designing", 1], ["evident", 1], ["holistic", 1], ["streamlined", 1], ["informative", 1], ["motivating", 1], ["excited", 1], ["show", 1], ["structured", 1], ["situation", 1], ["reviewing", 1], ["wanting", 1], ["congratulation", 1], ["pennsylvania", 1], ["hope", 1], ["subject", 1], ["overthought", 1], ["towards", 1], ["wish", 1], ["e", 1], ["g", 1], ["modifying", 1], ["reassigning", 1], ["spoke", 1], ["feeling", 1], ["mutual", 1], ["studying", 1], ["machine", 1], ["putting", 1], ["form", 1], ["impose", 1], ["rigor", 1], ["systematic", 1], ["taken", 1], ["everything", 1], ["leading", 1], ["every", 1], ["stroke", 1], ["recalibrates", 1], ["normal", 1], ["pattern", 1], ["intuitive", 1], ["wait", 1], ["begin", 1], ["mooc", 1], ["offered", 1], ["quite", 1], ["exposure", 1], ["improved", 1], ["debug", 1], ["exciting", 1], ["persistent", 1], ["shall", 1], ["succeed", 1], ["flex", 1], ["muscle", 1], ["love", 1], ["motivation", 1], ["upenn", 1], ["advice", 1], ["clarification", 1], ["second", 1], ["revisit", 1], ["comment", 1], ["compelling", 1], ["paired", 1], ["practical", 1], ["forwarded", 1], ["stand", 1], ["among", 1], ["graduate", 1], ["education", 1], ["allows", 1], ["efficient", 1], ["expedient", 1], ["accessible", 1], ["internet", 1], ["connection", 1], ["began", 1], ["contrive", 1], ["physician", 1], ["acquired", 1]]}