{"course": "py4e", "comments": [{"content": "Excellent, although, even without having any programming experience except some Visual Basic at school about ten years ago, in my opinion the course could have bee more difficult and the pace quicker.\n", "time": "2020-12-31", "source": "Coursera", "upvotes": "14"}, {"content": "Extremely basic but Dr. Chuck is so interesting that you never get bored. You can pass the course in a few days with minimum or even no programming knowledge. It's a good starting point for beginners.  \n", "time": "2020-11-23", "source": "Coursera", "upvotes": "17"}, {"content": "Lecture videos were broken into small parts whereby it's easy to understand and digest. Assessment given were relevant to what was taught for each segment. Navigating around course contents were easy.\n", "time": "2021-01-05", "source": "Coursera", "upvotes": "0"}, {"content": "first time i had done any course online and this was a wonderful experience \n", "time": "2021-01-09", "source": "Coursera", "upvotes": "0"}, {"content": "I learned all the stuff and the explanation provided was good.\n", "time": "2020-12-27", "source": "Coursera", "upvotes": "1"}, {"content": "i would like to do more courses from here\n", "time": "2020-11-26", "source": "Coursera", "upvotes": "3"}, {"content": "thank you! Great introduction to Python and programming as a whole. Everything is broken down making it easy to understand. Had zero programming experience before and this class made it easy and fun to get into. \n", "time": "2020-11-19", "source": "Coursera", "upvotes": "4"}, {"content": "Great introduction to Python and programming as a whole. Everything is broken down making it easy to understand. Had zero programming experience before and this class made it easy and fun to get into. \n", "time": "2020-11-10", "source": "Coursera", "upvotes": "6"}, {"content": "After trying tutorial after tutorial and exploring many different resources to learn Python, I have finally found one that works! This is a very fun course, and the free textbook is simply incredible. \n", "time": "2020-11-21", "source": "Coursera", "upvotes": "15"}, {"content": "The professor's lecture is so awesome, however, the content is adjust to the new programming learners. I heared extended part of the course is charged,  you can purchased it if you want deeper learning\n", "time": "2021-01-08", "source": "Coursera", "upvotes": "1"}, {"content": "I did not find this course helpful. The assignments seem to ask for more info that you've been taught in any of the videos. My analogy for the course is this: It's like making a newborn baby watch a video on swimming and then throwing it into the ocean and acting shocked when it doesn't know how to swim. The mentors in the discussion forum are condescending and do not help when you don't understand the terms they are using. I would not recommend this course for beginners.\n", "time": "2020-12-01", "source": "Coursera", "upvotes": "13"}, {"content": "Very good introduction to basic programming. Very easy for beginners in python who have already some programming background - but still extremely useful to quickly and efficiently learn python basics.\n", "time": "2020-12-26", "source": "Coursera", "upvotes": "20"}, {"content": "I completed the course in about three days. I've never programmed before to the learning curve was excruciating but nonetheless I managed to get through and finally get my python feet wet so to speak.\n", "time": "2021-01-02", "source": "Coursera", "upvotes": "20"}, {"content": "Thank you. It was a worthwhile course. Entertaining as well. I just wish that there were more sample homework before the exercises so students could see how the lessons are applied to actual problems. \n", "time": "2021-01-07", "source": "Coursera", "upvotes": "19"}, {"content": "Easy to follow and not boring. The instructor breaks things down in simple form. The Coursera platform is sometimes a bit quirky but otherwise the content in this course I thought was quite excellent.\n", "time": "2020-10-23", "source": "Coursera", "upvotes": "16"}, {"content": "Very slow pace, might be good for totally beginners BUT if you know anything about CS or programming it will be too slow for you.\n", "time": "2020-12-15", "source": "Coursera", "upvotes": "3"}, {"content": "excellent for beginners, very well described, great understanding grasped and its simple, very simple, but thats what makes it 5 star, is that its for anyone or as the title says pythong for Everybody\n", "time": "2020-11-19", "source": "Coursera", "upvotes": "6"}, {"content": "Dr. Chuck has a special ability to teach programming to people who doesn't necessarily have programming background. This is rare among programming teachers, and shows that he is an excellent educator.\n", "time": "2020-12-04", "source": "Coursera", "upvotes": "10"}, {"content": "This course is organized and explained very well.  It is moderately challenging, and I recommend it to get interested in Python.  The teacher and the assistant staff are very good.  I enjoyed the course.\n", "time": "2020-12-16", "source": "Coursera", "upvotes": "15"}, {"content": "Extremely well laid out curriculum, to the point videos and excellent book. Built my confidence level to clear the course. Thanks Dr.Chuck for all the hard work and diligence to support the community.\n", "time": "2020-12-10", "source": "Coursera", "upvotes": "11"}, {"content": "Great teacher Chuck and obviously a great course for people just starting out with programming. Well paced. The suggested timings for the assignments were a bit off, I think, but well, that's just me. \n", "time": "2020-10-24", "source": "Coursera", "upvotes": "17"}, {"content": "this course is extremely suitable for an individual who does not know anything about python. but after i learned the course . it seems  like a litter bit of easy. i commend that at the final of the course. the text should tend to more difficult so that people who learn this course can actually improve programming skill\n", "time": "2020-11-17", "source": "Coursera", "upvotes": "16"}, {"content": "i know about a bit of programming language skills by using c or c++. But i also wanted to learn about the python programming language, so i decided to go with coursera & i want to say....waao...Dr. Chuck is awesome, the way he taught is pretty great... i mean to say that... this course is pretty awesome for everyone who want to go with python programming language So, i'm highly recommending to go with this course. \n", "time": "2020-12-14", "source": "Coursera", "upvotes": "18"}, {"content": "I really enjoyed the course.\n", "time": "2020-10-14", "source": "Coursera", "upvotes": "5"}, {"content": "Charles Severance explains every concept in a simple way with good examples.Great way to start. It is excellent for persons with no programming background\n", "time": "2020-10-18", "source": "Coursera", "upvotes": "8"}, {"content": "Best Course I have done on Coursera\n", "time": "2020-10-14", "source": "Coursera", "upvotes": "17"}, {"content": "Excellent course.  The pace was perfect, it was not so long that it was daunting to finish and it did not take too much weekly free time either.  Despite this, I was still able to learn a great deal and am still motivated to continue with the rest of the specialization.  \n", "time": "2020-11-03", "source": "Coursera", "upvotes": "16"}, {"content": "Extremely basic but Dr. Chuck is so interesting that you never get bored. You can pass the course in a few days with minimum or even no programming knowledge. It's a good starting point for beginners.\n", "time": "2020-10-26", "source": "Coursera", "upvotes": "13"}, {"content": "well i am thankful for such platform for providing  and me to develop my programming skill, and also for respected sir  Charles Russell Severance , the way he teaches i understand from basics of python. \n", "time": "2020-10-31", "source": "Coursera", "upvotes": "1"}, {"content": "I got a 95% and maybe I learned something but I can honestly say it wasn't because I watched the videos - the professor is seriously disconnected. Programming for \"Everybody\"? I know what I want to do with programming, but all the examples and small programs you write in this course give you no idea of what of someone outside science and math will ever use programming for. \n", "time": "2020-12-27", "source": "Coursera", "upvotes": "12"}, {"content": "Two weeks of all sort of nonsense, including macarena, Harry Potter, sorting hat, videos of meaningless travels and lots of self-promotion. Pure crap that doesn´t worth anybody´s time. When theory started on week 3 it was confusing, boring and as time is life I decided to quit.  It shocked me that a serious university like University of Michigan has a clown on its payroll.\n", "time": "2020-11-23", "source": "Coursera", "upvotes": "16"}, {"content": "I loved it! Dr. Chuck is extraordinary in his explanations. A great way to start on Python programming. As a person that hasn't programmed in years it was an encouraging and educational experience :-)\n", "time": "2020-11-18", "source": "Coursera", "upvotes": "6"}, {"content": "  Great introduction to Python and programming as a whole. Everything is broken down making it easy to understand. Had zero programming experience before and this class made it easy and fun to get into.  \n", "time": "2020-11-01", "source": "Coursera", "upvotes": "10"}, {"content": "  Easy to follow and not boring. The instructor breaks things down in simple form. The Coursera platform is sometimes a bit quirky but otherwise the content in this course I thought was quite excellent.  \n", "time": "2020-11-12", "source": "Coursera", "upvotes": "7"}, {"content": "A really simple and what is the most important a clear course.\n", "time": "2020-11-16", "source": "Coursera", "upvotes": "8"}, {"content": "Really hope that next sessions are created in the same manner.\n", "time": "2020-12-23", "source": "Coursera", "upvotes": "4"}, {"content": "Will highly recommend to anyone who decides to start studying Python\n", "time": "2021-01-11", "source": "Coursera", "upvotes": "18"}, {"content": "We tried to use this class to teach a brown bag lunch for our employees interested in programming.  Python is a great language but this class has a very low content to volume ratio (nobody wants to watch the instructor meet his life-time idol at a trade-show or watch the Intel versus AMD melt-down commercials over their lunch break).\n", "time": "2020-11-06", "source": "Coursera", "upvotes": "2"}, {"content": "A well-designed course, especially for the beginners, who are really enthusiastic and passionate about programming. It really helps you to learn from scratch and it does not require any prerequisites.\n", "time": "2020-11-12", "source": "Coursera", "upvotes": "11"}, {"content": "  Great introduction to Python and programming as a whole. Everything is broken down making it easy to understand. Had zero programming experience before and this class made it easy and fun to get into.  \n", "time": "2020-12-20", "source": "Coursera", "upvotes": "16"}, {"content": "Great introduction to Python and programming as a whole. Everything is broken down making it easy to understand. Had zero programming experience before and this class made it easy and fun to get into. \n", "time": "2020-12-11", "source": "Coursera", "upvotes": "4"}, {"content": "Great course to start programming  in Python.\n", "time": "2020-12-22", "source": "Coursera", "upvotes": "12"}, {"content": "The course material is fine. In fact its good. However I completed the entire course in 4 hours. Whilst I have some basic programming experience I am by no means an expert. There really is very very little material in this course. The assignments are also very simple and automatically graded. The course fees are not particularly transparent. I think the course is FAR too expensive for the content provided. All of the other reviews I have seen for this course are a single line such as 'I liked the course a lot' or something equally vacuous and unhelpful. If you are a beginner I would suggest trying 'Python for the absolute beginner' by Michael Dawson. If you have ANY programming experience, you might be better with a more advanced course.\n", "time": "2020-11-16", "source": "Coursera", "upvotes": "1"}, {"content": "To be honest, I thought the course stumbled and fell short.  It was too basic and slow paced.  The tone was a bit immature at times, and perhaps appropriate only for a grade school level classroom--not something for working professionals.  And it's certainly not mature enough or challenging enough for a university class.  Even if the goal were to teach those with no programming experience, it could accomplish that  while providing more content, and making the content relevant. \n", "time": "2020-12-12", "source": "Coursera", "upvotes": "0"}, {"content": "Is the course worth the price?  Hell no.  If you do pay, you may feel very cheated at the end.  The entire course can be reduced to 3 pages of notes.  One would be better off checking into other free, online tutorials.    \n", "time": "2020-12-14", "source": "Coursera", "upvotes": "5"}, {"content": "I'm not sure about the value of the videos titled \"Office Hours.\"  They all appeared as self-promotional behavior from the professor, as if to say, \"hey look how great I am making this video in Paris.\"  They're really nothing more than that.  In one video, he corners a guest speaker at a conference, who appears annoyed after a few minutes and gives the professor a polite brush-off:  \"other people here would like to talk with me too.\"  After all of these videos, you will ask yourself, \"okay, why did Severance make me watch that?\"  \"What was the point?\"  And you'll shrug your shoulders and say, \"another waste of time.\"\n", "time": "2020-11-16", "source": "Coursera", "upvotes": "13"}, {"content": "Tan solo auditar este curso me ayudó bastante en el aprendizaje de este lenguage de programación. A penas ahorre el dinero compraré el resto de cursos para seguir adelante. Gracias Charles Severance!!\n", "time": "2020-11-17", "source": "Coursera", "upvotes": "3"}, {"content": "Good systematic course for beginners - although for real beginners some parts may be quite a bit too geeky, the promise that even if you don't know much about computers you will still be able to follow the course doesn't convince me. If you had some experience with programming, go at your own speed with the course materials and you will be able to finish within a couple of hours - I finished the whole seven weeks in two days, not working on it full time and watching all the videos, which is not really necessary. Some of the examples don't seem to make much practical sense, which would be good for motivation, but they serve their purpose to understand syntax and structure. Some have errors, which is surprising given the huge audience that can help to correct them. There are extra materials about hard- and software developers that are not really connected.\n", "time": "2020-11-21", "source": "Coursera", "upvotes": "12"}, {"content": "Great introduction to Python and programming as a whole. Everything is broken down making it easy to understand. Had zero programming experience before and this class made it easy and fun to get into. \n", "time": "2020-10-23", "source": "Coursera", "upvotes": "0"}, {"content": "Most vague info, assignments don't even have  anything to do  with the videos, and the videos are not helpful because they don't give any examples. Terrible, and extremely hard. I do not recommend this course to beginners, or to anyone for that fact. \n", "time": "2020-10-15", "source": "Coursera", "upvotes": "13"}, {"content": "  Extremely basic but Dr. Chuck is so interesting that you never get bored. You can pass the course in a few days with minimum or even no programming knowledge. It's a good starting point for beginners.  \n", "time": "2020-12-15", "source": "Coursera", "upvotes": "0"}, {"content": "  Course was very intresting and interactive. And also looking forward to start python data structure course. Charles sir was teaching perfectly and his lecture content was also very helpful.Thank you!!  \n", "time": "2020-11-06", "source": "Coursera", "upvotes": "5"}, {"content": "I love Coursera , it's so helpful for me . I hope that other lessons and courses are also cool like this and the Dr. Chuck ia the coolest ever teacher i have ever seen so thank you very much Coursera.\n", "time": "2020-10-18", "source": "Coursera", "upvotes": "18"}, {"content": " If I were to compare the quality of this class to something I would say that this class is like a Chess class that spends 30 minutes explaining how pawns work and then asks you to move Knight to C3. \"Wait, what piece is the Knight? How does the Knight move again? What's C3? Help!\"  That's basically what you will get out of this course.\n", "time": "2021-01-06", "source": "Coursera", "upvotes": "15"}, {"content": "This class is not a good choice for someone starting from the ground up. It's no so much that it doesn't cover entry-level concepts, rather it fails to elaborate on these concepts. The feedback from the quizzes doesn't point you in the direction where you can learn from your mistakes.\n", "time": "2020-12-26", "source": "Coursera", "upvotes": "13"}, {"content": "Likewise the assignments are often two steps ahead of the video, meaning that when error messages pop up in the auto-grader there is no way to figure out where you can learn what you did wrong. the videos will cover steps a, b, and c but the assignments expect you to know steps d, e, and f. This leaves students to discuss the answers in the forums or on other sites which I understand is frowned upon. However for \"green as grass\" students this is the only way to get anything done. And when students try to explain how the code actually works to each other their threads get locked down, only cryptic and vague responses to issues will remain.  That is abysmal.\n", "time": "2020-10-24", "source": "Coursera", "upvotes": "5"}, {"content": "When I seem to get more help from other students in the comments than from the moderators in the forum, that is an issue. And lets talk about the moderator, there is only one. One for how many students? One for how many questions? Even if there was just 5 more people answering in the forums it would greatly improve the quality of this class. And those moderators should do more than just refer students back to the book which often provides insufficient information to tackle a problem. \n", "time": "2021-01-17", "source": "Coursera", "upvotes": "19"}, {"content": "This class needs to be reviewed extensively.  I wouldn't recommend this course to anyone fresh that wants to try to learn code. I am very disappointed with this programming course. The course lacks detail and deepth and could be taught in 45 to 60 minutes instead of 7 weeks. The quizzes and assignments were to easy and basic (solved in less than 5 minutes) and definitely not enough. Annoying was the overuse of colours in almost every video (almost everything was coloured - highlighting everything is just as usefull as highlighting nothing, green box with white text inside - did you try to read that on a different monitor than yours?), the pointless and useless doodles, smilies and whatsoever, wasting my time by watching you dispose your teabag/drinking tea or coffee/talking about your mug/etc., why do you even need to drink in a 20 minute-or-less video. The Tutor tried to loosen a dry topic. Mostly it wasn't my humor but I can live with that. I had hoped for more :(\n", "time": "2020-10-15", "source": "Coursera", "upvotes": "12"}], "word_cloud": [["course", 55], ["programming", 42], ["python", 21], ["easy", 19], ["video", 17], ["get", 16], ["great", 16], ["class", 15], ["experience", 13], ["good", 12], ["beginner", 12], ["understand", 11], ["basic", 10], ["chuck", 9], ["content", 9], ["time", 9], ["making", 9], ["learn", 9], ["excellent", 8], ["dr", 8], ["would", 8], ["everything", 8], ["broken", 7], ["like", 7], ["introduction", 7], ["whole", 7], ["fun", 7], ["assignment", 7], ["know", 7], ["student", 7]]}